request-update.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:st="http://solvegentest/generated">
    <soapenv:Header/>
    <soapenv:Body>
        <st:updateCatalogRequest>
            <st:book id="bk102">
                <st:author>Ralls, Kim</st:author>
                <st:title>Midnight </st:title>
                <st:genre>Fantasy</st:genre>
                <st:price>15.95</st:price>
                <st:publish_date>2015-12-10</st:publish_date>
                <st:description>After the collapse of a nanotechnology  society in England, the young survivors lay the  foundation for a new society.</st:description>
            </st:book>
        </st:updateCatalogRequest>
    </soapenv:Body>
</soapenv:Envelope>